[net]
batch=256
channels=3
height=56
width=56

[convolutional]
filters=64
size=7
stride=2
pad=3
batch_normalize=1
activation=relu

[maxpool]
size=3
stride=2
padding=0

[convolutional]
filters=64
size=1
stride=1
pad=0
batch_normalize=1
activation=linear

[route]
layers=-2

[convolutional]
filters=64
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=64
size=3
stride=1
pad=1
batch_normalize=1
activation=linear

[shortcut]
from=-4
activation=relu

[convolutional]
filters=128
size=1
stride=2
pad=0
batch_normalize=1
activation=linear

[route]
layers=-2

[convolutional]
filters=128
size=3
stride=2
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=128
size=3
stride=1
pad=1
batch_normalize=1
activation=linear

[shortcut]
from=-4
activation=relu

[avgpool]

